src/src/DataProcessors/AdministrationPanel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>AdministrationPanel</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/src/AccumulationRegisters/Workload.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>Workload</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>StandardHours</Name>
					<Comment>Import in hours</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>QuantityPlan</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>QuantityFact</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Performer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Teams</v8:Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Operation</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Products</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Characteristic</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/src/Catalogs/Companies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Companies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>BankAccountByDefault</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BusinessCalendar</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Calendars</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DescriptionFull</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileFacsimilePrinting</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CompaniesAttachedFiles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Individual</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Individuals</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LegalEntityIndividual</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CounterpartyType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LogoFile</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CompaniesAttachedFiles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PettyCashByDefault</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Prefix</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegistrationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegistrationNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegistrationCountry</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Countries</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LegalForm</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LegalForms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ContactInformation</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ContactInformationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Kind</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContactInformationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldValues</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Country</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Region</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>City</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EmailAddress</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ServerDomainName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumberWithoutCodes</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ActivityTypes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ActivityType</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ActivityTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/src/DataProcessors/AdministrationPanel/Forms/SettingAccountingByCompanies/Ext/Form/Module.bsl
#Region ServiceProceduresAndFunctions

// Procedure updates the availability of the Company flag RunAccountingBySubsidiaryCompany.
//
&AtClient
Procedure RefreshSubsidiaryCompanyEnabled()
	
	Items.ParentCompany.Enabled = ConstantsSet.AccountingBySubsidiaryCompany;
	Items.ParentCompany.AutoChoiceIncomplete = ConstantsSet.AccountingBySubsidiaryCompany;
	Items.ParentCompany.AutoMarkIncomplete = ConstantsSet.AccountingBySubsidiaryCompany;
	
	If CheckEditRightOfParentCompanyConstant() AND Not ConstantsSet.AccountingBySubsidiaryCompany Then
		ConstantsSet.ParentCompany = PredefinedValue("Catalog.Companies.EmptyRef");
	EndIf;
	
EndProcedure

&AtServerNoContext
Function CheckEditRightOfParentCompanyConstant()
	
	Return AccessRight("Edit", Metadata.Constants.ParentCompany);
	
EndFunction

// Check on the possibility to disable the UseSeveralCompanies option.
//
&AtServer
Function CancellationUncheckUseSeveralCompanies()
	
	SetPrivilegedMode(True);
	
	Cancel = False;
	
	MainCompany = Catalogs.Companies.MainCompany;
	
	SelectionCompanies = Catalogs.Companies.Select();
	While SelectionCompanies.Next() Do
		
		If SelectionCompanies.Ref <> MainCompany Then
			
			RefArray = New Array;
			RefArray.Add(SelectionCompanies.Ref);
			RefsTable = FindByRef(RefArray);
			
			If RefsTable.Count() > 0 Then
				
				MessageText = NStr("en = 'Companies that differ from the main one are used in the infobase. Cannot clear the check box.'");
				DriveServer.ShowMessageAboutError(ThisForm, MessageText, , , "ConstantsSet.UseSeveralCompanies", Cancel);
				Break;
				
			EndIf;
			
		EndIf;
		
	EndDo;
	
	SetPrivilegedMode(False);
	
	Return Cancel;
	
EndFunction

// Check on the possibility to change the established company.
//
&AtServer
Function CancellationSetAccountingBySubsidiaryCompanyChangeSubsidiaryCompany(FieldName)
	
	ParentCompany = ConstantsSet.ParentCompany;
	AccumulationRegistersCounter = 0;
	AreRecords = False;
	Query = New Query;
	Query.SetParameter("ParentCompany", ParentCompany);
	
	For Each AccumulationRegister In Metadata.AccumulationRegisters Do
		
		If AccumulationRegister = AccumulationRegisters.Workload Then
			Continue;
		EndIf;
			
		Query.Text = Query.Text + 
			?(Query.Text = "",
				"SELECT ALLOWED TOP 1", 
				"UNION ALL 
				|
				|SELECT TOP 1 ") + "
				|
				|	AccumulationRegister" + AccumulationRegister.Name + ".Company
				|FROM
				|	AccumulationRegister." + AccumulationRegister.Name + " AS " + "AccumulationRegister" + AccumulationRegister.Name + "
				|WHERE
				|	AccumulationRegister" + AccumulationRegister.Name + ".Company <> &ParentCompany
				|";
		
		AccumulationRegistersCounter = AccumulationRegistersCounter + 1;
		
		If AccumulationRegistersCounter > 3 Then
			AccumulationRegistersCounter = 0;
			Try
				QueryResult = Query.Execute();
				AreRecords = Not QueryResult.IsEmpty();
			Except
				
			EndTry;
			
			If AreRecords Then
				Break;
			EndIf; 
			Query.Text = "";
		EndIf;
		
	EndDo;
	
	If AccumulationRegistersCounter > 0 Then
		Try
			QueryResult = Query.Execute();
			If Not QueryResult.IsEmpty() Then
				AreRecords = True;
			EndIf;
		Except
		
		EndTry;
	EndIf;
	
	If AreRecords Then
		MessageText = NStr("en = 'Records are registered for a company that is different from the company in the infobase. Cannot change the parameter.'");
		DriveServer.ShowMessageAboutError(ThisForm, MessageText, , , FieldName);
		Return True;
	Else
		Return False;
	EndIf;
	
EndFunction

// Check on the possibility to disable the AccountingBySubsidiaryCompany option.
//
&AtServer
Function CancellationUncheckAccountingBySubsidiaryCompany()
	
	ParentCompany = Constants.ParentCompany.Get();
	DocumentsCounter = 0;
	Query = New Query;
	For Each Doc In Metadata.Documents Do
		
		If Doc.Posting = Metadata.ObjectProperties.Posting.Deny Then
			Continue;
		EndIf;

		Query.Text = Query.Text +
			?(Query.Text = "",
				"SELECT ALLOWED TOP 1",
				"UNION ALL
				|
				|SELECT TOP 1 ") + "
				|
				|	Document" + Doc.Name + ".Ref FROM Document." + Doc.Name + " AS " + "Document" + Doc.Name + "
				|	WHERE document" + Doc.Name + ".Company
				|	<> &ParentCompany AND Document" + Doc.Name + ".Posted
				|";
		
		DocumentsCounter = DocumentsCounter + 1;
		
		If DocumentsCounter > 3 Then
			DocumentsCounter = 0;
			Try
				Query.SetParameter("ParentCompany", ParentCompany);
				QueryResult = Query.Execute();
				AreDocuments = Not QueryResult.IsEmpty();
			Except
				
			EndTry;
			
			If AreDocuments Then
				Break;
			EndIf; 
			Query.Text = "";
		EndIf;
		
	EndDo;
	
	If DocumentsCounter > 0 Then
		Try
			QueryResult = Query.Execute();
			AreDocuments = Not QueryResult.IsEmpty();
		Except
			
		EndTry;
	EndIf;
	
	If AreDocuments Then
		MessageText = NStr("en = 'There are posted documents of a company which differs from the company in the infobase. You cannot clear the ""Company accounting"" check box.'");	
		DriveServer.ShowMessageAboutError(ThisForm, MessageText, , , "ConstantsSet.AccountingBySubsidiaryCompany");
		Return True;
	Else
		Return False;
	EndIf;
	
EndFunction

#Region FormCommandHandlers

// Procedure - command handler CompanyCatalog.
//
&AtClient
Procedure CatalogCompanies(Command)
	
	If Modified Then
		
		Message = New UserMessage();
		Message.Text = NStr("en = 'Data is not written yet. You can start editing the ""Companies"" catalog only after the data is written.'");
		Message.Message();
		Return;
		
	EndIf;
	
	If ConstantsSet.UseSeveralCompanies Then
		
		OpenForm("Catalog.Companies.ListForm");
		
	Else
		
		ParemeterCompany = New Structure("Key", PredefinedValue("Catalog.Companies.MainCompany"));
		OpenForm("Catalog.Companies.ObjectForm", ParemeterCompany);
		
	EndIf;
	
EndProcedure

#EndRegion

#EndRegion

#Region ProcedureFormEventHandlers

// Procedure - OnOpen form event handler
//
&AtClient
Procedure OnOpen(Cancel)
	
	RefreshSubsidiaryCompanyEnabled();
	ConstantValue = ConstantsSet.UseSeveralCompanies;
	
	Items.CompanySettingsSettings.Enabled	= ConstantValue;
	ValueOnOpenAccountingForSeveralCompanies 	= ConstantValue;
	
EndProcedure

// Procedure - event handler BeforeWriteAtServer form.
//
&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	// If there are references to the company different from the main company, it is not allowed to clear the
	// UseSeveralCompanies flag.
	If Constants.UseSeveralCompanies.Get() <> ConstantsSet.UseSeveralCompanies
		AND (NOT ConstantsSet.UseSeveralCompanies) 
		AND CancellationUncheckUseSeveralCompanies() Then
		
		ConstantsSet.UseSeveralCompanies = True;
		Cancel = True;
		Return;
		
	EndIf;
	
	// If the AccountingBySubsidiaryCompany flag is set, then the company must be filled.
	If ConstantsSet.AccountingBySubsidiaryCompany 
		AND Not ValueIsFilled(ConstantsSet.ParentCompany) Then
		
		MessageText = NStr("en = 'The ""Keep accounting by company"" check box is selected, but the company is not filled in.'");
		DriveServer.ShowMessageAboutError(ThisForm, MessageText, , , "ConstantsSet.ParentCompany", Cancel);
		Return;
		
	EndIf;
	
	// If there are any records of the company different from the selected company, it is not allowed to select AccountingBySubsidiaryCompany.
	If Constants.AccountingBySubsidiaryCompany.Get() <> ConstantsSet.AccountingBySubsidiaryCompany AND ConstantsSet.AccountingBySubsidiaryCompany
		AND CancellationSetAccountingBySubsidiaryCompanyChangeSubsidiaryCompany("ConstantsSet.AccountingBySubsidiaryCompany") Then
		
		ConstantsSet.AccountingBySubsidiaryCompany = False;
		ConstantsSet.ParentCompany = Catalogs.Companies.EmptyRef();
		Items.ParentCompany.Enabled = False;
		Items.ParentCompany.AutoChoiceIncomplete = False;
		Items.ParentCompany.AutoMarkIncomplete = False;
		Cancel = True;
		Return;
		
	EndIf;
	
	// If there are any posted documents of the company different from the company, it is not allowed to clear AccountingBySubsidiaryCompany.
	If Constants.AccountingBySubsidiaryCompany.Get() <> ConstantsSet.AccountingBySubsidiaryCompany AND (NOT ConstantsSet.AccountingBySubsidiaryCompany)
		AND CancellationUncheckAccountingBySubsidiaryCompany() Then
		
		ConstantsSet.AccountingBySubsidiaryCompany = True;
		ConstantsSet.ParentCompany = Constants.ParentCompany.Get();
		Items.ParentCompany.Enabled = True;
		Items.ParentCompany.AutoChoiceIncomplete = True;
		Items.ParentCompany.AutoMarkIncomplete = True;
		Cancel = True;
		Return;
		
	EndIf;
	
	// If there are any records of the company different from the selected company, it is not allowed to change Company.
	If Constants.ParentCompany.Get() <> ConstantsSet.ParentCompany
		AND ValueIsFilled(ConstantsSet.ParentCompany)
		AND ValueIsFilled(Constants.ParentCompany.Get())
		AND CancellationSetAccountingBySubsidiaryCompanyChangeSubsidiaryCompany("ConstantsSet.ParentCompany") Then
		
		ConstantsSet.ParentCompany = Constants.ParentCompany.Get();
		Cancel = True;
		Return;
		
	EndIf;
	
EndProcedure

// Procedure - event handler AfterWrite form.
//
&AtClient
Procedure AfterWrite(WriteParameters)
	
	ConstantValue = ConstantsSet.UseSeveralCompanies;
	If ValueOnOpenAccountingForSeveralCompanies <> ConstantValue Then
		
		Notify("Record_ConstantsSet", New Structure("Value", ConstantValue), "UseSeveralCompanies");
		
	EndIf;
	
EndProcedure

#Region ProcedureEventHandlersOfFormAttributes

// Procedure - event handler OnChange of the AccountingBySubsidiaryCompany field.
//
&AtClient
Procedure AccountingBySubsidiaryCompanyOnChange(Item)
	
	If ConstantsSet.AccountingBySubsidiaryCompany
	AND Not ValueIsFilled(ConstantsSet.ParentCompany) Then
		ConstantsSet.ParentCompany = PredefinedValue("Catalog.Companies.MainCompany");
	EndIf;
	
	RefreshSubsidiaryCompanyEnabled();
	
EndProcedure

// Procedure - event handler OnChange of the UseSeveralCompanies field.
//
&AtClient
Procedure UseSeveralCompaniesOnChange(Item)
	
	ConstantValue = ConstantsSet.UseSeveralCompanies;
	
	If Not ConstantValue Then
		
		ConstantsSet.AccountingBySubsidiaryCompany = False;
		ConstantsSet.ParentCompany = "";
		
	EndIf;
	
	RefreshSubsidiaryCompanyEnabled();
	Items.CompanySettingsSettings.Enabled = ConstantValue;
	
	RefreshInterface();
	
EndProcedure
// 

#EndRegion

#EndRegion
